INSPECT__artillery_sin_log.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 10:29:23(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 10:29:25(-0300)

All VUs finished. Total time: 15 seconds

--------------------------------
Summary report @ 10:29:36(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 44/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 35
  max: ......................................................................... 541
  median: ...................................................................... 202.4
  p95: ......................................................................... 301.9
  p99: ......................................................................... 459.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 10488
  max: ......................................................................... 11234
  median: ...................................................................... 11050.8
  p95: ......................................................................... 11274.1
  p99: ......................................................................... 11274.1